Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: གང་འོད་གསལ་བ་དེ་སེམས་ཀྱི་རང་བཞིན་ནོ། །
en: and clarity is the nature of the mind.

source: སེམས་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་འཇུག་པའོ། །
en: The nature of the mind is penetration;

source: གང་འཇུག་པ་དེ་མཚན་མ་ཐམས་ཅད་གནོན་པའོ། །
en: penetration overcomes all marks;

source: གང་མཚན་མ་ཐམས་ཅད་གནོན་པ་དེ་སྐྱོན་མེད་པ་ལ་འཇུག་པ་ཞེས་བྱའོ། །
en: and those who overcome all marks are said to enter into faultlessness.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་ལ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་སྟེ།
en: The bodhisattvas who enter into faultlessness reach acceptance of the unborn nature of phenomena.

source: དེས་ན་སྐྱོན་མེད་པ་ལ་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་ཞེས་བྱའོ། །
en: They are therefore referred to as ‘bodhisattvas who have entered into faultlessness and reached acceptance of the unborn nature of phenomena.’

source: གང་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་དེས་ཐམས་ཅད་བཟོད་དེ། དེ་སྟོང་པར་ཡང་བཟོད་དེ་གང་ཟག་ཏུ་ཡང་བཟོད་དོ། །
en: “Those who have reached acceptance of the unborn nature of phenomena have reached acceptance with respect to everything, with respect to both emptiness and persons.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that so?

source: གང་ཟག་ལས་སྟོང་པ་གཞན་མ་ཡིན་ཏེ།
en: Because emptiness is not different from persons;

source: གང་ཟག་ཉིད་སྟོང་པའོ། །
en: persons themselves are emptiness.

source: དེ་མཚན་མར་ཡང་བཟོད་དེ་མཚན་མ་མེད་པར་བཟོད་པའོ། །
en: They have reached acceptance with respect to both marks and the absence of marks.

source: མཚན་མའི་ངོ་བོ་ཉིད་མཚན་མ་མེད་པའོ། །
en: Because the essential nature of marks is the absence of marks.

source: དེ་སྨོན་པར་ཡང་བཟོད། དེ་སྨོན་པ་མེད་པ་ཡང་བཟོད་དོ། །
en: They have reached acceptance with respect to both wishes and the absence of wishes.

source: སྨོན་ལམ་གྱི་ངོ་བོ་ཉིད་ཀྱི་མཚན་ཉིད་སྨོན་པ་མེད་པའོ། །
en: Because the characteristic of the essential nature of wishes is the absence of wishes.

source: དེ་སེམས་ཅན་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་ཡང་བཟོད་དེ་སེམས་ཅན་རྣམས་འཆི་འཕོ་བ་དང་སྐྱེ་བར་ཡང་བཟོད་དོ། །
en: They have reached acceptance with respect to beings’ inherent transcendence of suffering as well their process of death and rebirth.

source: འཆི་འཕོ་དང་སྐྱེ་བ་ནི་སྒྱུ་མའི་ངོ་བོ་ཉིད་དོ། །
en: Because death and rebirth have the essential nature of being illusions.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་འགག་པ་མེད་པ་སྟེ། ཆོས་ཐམས་ཅད་དང་འགལ་བ་མེད་པ་ཡིན་ནོ། །
en: Noble son, the bodhisattvas who have reached acceptance of the unborn nature of phenomena in this way are without cessation and are not in conflict with any phenomenon.

source: བདག་བཟོད་པའི་རྗེས་སུ་འགྲོ་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བས་ཀྱང་འགྲོ།
en: Their acceptance with respect to the self encompasses all sentient beings, and

source: བདག་བཟོད་པ་རྗེས་སུ་འགྲོ་ཡང་ཆོས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བས་ཀྱང་འགྲོ་སྟེ། འོང་བ་ཡང་མེད། འགྲོ་བ་ཡང་མེད་དོ། །
en: it also encompasses all phenomena, since it is beyond coming and going.

source: ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པར་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ། །ཇི་ལྟར་ཆོས་ཀྱི་དབྱིངས་ལ་གནས་པ་དེ་ལྟར་སེམས་ཅན་ཐམས་ཅད་གནས་ཏེ།
en: They correctly know that all phenomena abide within the realm of phenomena and that the same goes for all beings.

source: གང་གི་གནས་དེ་འཐོབ་པའི་གནས་མེད་པའི་ཚུལ་གྱིས་རྗེས་སུ་ཐོབ་པ་དེ་སྒྲའི་བརྡའི་ཐ་སྙད་ཀྱི་སྒྲ་ཉེ་བར་བཟུང་ནས། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་དང་ལྡན་པ་ཞེས་བྱའོ། །
en: That attainment whereby nothing is attained is referred to in conventional terms as ‘gaining acceptance of the unborn nature of phenomena.’

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ནི་གང་གིས་ཀྱང་བརྗོད་པའམ། བསྙད་པའམ། བསྟན་པར་མི་ནུས་སོ། །
en: This acceptance of the unborn nature of phenomena cannot be expressed, described, or demonstrated.

source: དོན་དེ་ནི་བརྗོད་དུ་མེད་པ། སྒྲ་མེད་པ། བཤད་དུ་མེད་པ་ཡིན་ཡང་བརྗོད་དུ་མེད་པའི་དོན་བརྗོད་པས་བསྟན་པ་འདི་ནི་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པའི་ཆེ་བ་ཉིད་དོ། །
en: Because its meaning is inexpressible, beyond words, and indescribable. Noble son, this teaching in which the inexpressible meaning is nevertheless expressed demonstrates the greatness of the Thus-Gone One!”

source: བཅོམ་ལྡན་འདས་ཀྱེ་མ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདི་ཇི་ཙམ་དུ་ཆོས་ཟབ་མོ་ལ་བཟོད་པ་སྟོན་པར་སྤོབས་པ་དང་། འདི་ལྟ་བུར་རྒྱ་ཆེ་བའི་ཡུལ་ལ་ཉེ་བར་སྤྱོད་ཅིང་ལོངས་སྤྱོད་པས་འབྱོར་བ་དང་། ཆོས་སྟོན་པས་ཟབ་མོའི་བཟོད་པ་འདི་ལྟ་བུ་དང་ལྡན་པ་ནི་ངོ་མཚར་ཏོ། །
en: “Oh, Blessed One, the kiṃnara king Druma’s eloquence in teaching the acceptance of the profound Dharma is amazing! So is his level of experience and perception of this vast domain, and his profound acceptance while teaching the Dharma!

source: བཅོམ་ལྡན་འདས་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་ན་དེས་འདི་སྤོབས་པ་འདི་ལྟ་བུ་གྲུབ་པར་གྱུར།
en: Blessed One, in relation to how many thus-gone ones, worthy ones, perfect buddhas did the kiṃnara king Druma create roots of virtue to develop such eloquence?”

source: རིགས་ཀྱི་བུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སྐར་མའི་གཟུགས་ཇི་སྙེད་པ་བགྲང་བའི་ཚུལ་གྱིས་ཚད་གཟུང་བར་ནུས་སམ།
en: “Noble son,” “are you able to count all the stars present in as many universes as there are grains of sand in the Ganges?

source: དེ་བཞིན་དུ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཇི་སྙེད་ཅིག་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བཙལ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་གནན་ཚངས་པར་སྤྱོད་པ་སྤྱད་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ཀྱང་ཚད་གཟུང་བར་མི་ནུས་ཏེ
en: Similarly, all the perfect buddhas in relation to whom the kiṃnara king Druma created roots of virtue, and all the thus-gone ones, the worthy ones, the perfect buddhas in whose presence he practiced pure conduct in his pursuit of unsurpassed and perfect awakening are uncountable.

source: དེས་ན་འདིའི་སྤོབས་པ་འདི་འདྲའོ། །
en: This is the reason why he has developed such eloquence.”

source: མིའམ་ཅིའི་བདག་པོ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མང་པོ་དེ་དག་ལས་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་དགེ་བའི་རྩ་བ་མང་པོ་དེ་ལྟ་བུ་བསྡོམས་པས་ཅི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའམ།
en: “Lord of the kiṃnaras, will you awaken to unsurpassed and perfect buddhahood due to the numerous roots of virtue you have accumulated in relation to all those many thus-gone ones, worthy ones, perfect buddhas?”

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་སྨྲས་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགེ་བའི་རྩ་བ་ཡང་དག་པར་སྒྲུབ་པ་ན། གང་དག་གིས་ནམ་དུ་ཡང་ངོམས་པར་མི་འགྱུར་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་ངོམས་པ་བཅུ་གཉིས་པོ་འདི་དག་སྟེ།
en: “Noble son,” replied the kiṃnara king Druma, “when bodhisattvas are creating roots of virtue, there are twelve activities they never tire of.

source: བཅུ་གཉིས་གང་ཞེ་ན།
en: What are those twelve?

source: དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བས་མི་ངོམས་པ་དང་། ཆོས་མཉན་པས་མི་ངོམས་པ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བས་མི་ངོམས་པ་དང་། ཆོས་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པས་མི་ངོམས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བས་མི་ངོམས་པ་དང་། དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྒྲུབ་པས་མི་ངོམས་པ་དང་། དགོན་པ་ལ་གནས་པས་མི་ངོམས་པ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་བསྐང་བས་མི་ངོམས་པ་དང་། ཡེ་ཤེས་མངོན་པར་རབ་ཏུ་དང་ཞིང་ཡོངས་སུ་སྨིན་པར་བྱ་བས་མི་ངོམས་པ་དང་། ཆོས་ངེས་པར་སེམས་ཤིང་ཚུལ་བཞིན་ལ་རབ་ཏུ་སྦྱོར་བས་མི་ངོམས་པ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་བཙལ་བས་མི་ངོམས་པ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྒྲུབ་པས་མི་ངོམས་པའོ། །
en: They never tire of (1) worshiping and venerating the thus-gone ones, (2) listening to the Dharma, (3) upholding the sacred Dharma, (4) teaching the Dharma at length, (5) bringing sentient beings to maturity, (6) producing roots of virtue, (7) living in the wilderness, (8) mastering all the perfections, (9) purifying and ripening wisdom, (10) contemplating the Dharma and correctly putting it into practice, (11) pursuing the accumulations of merit and wisdom, and (12) accomplishing all the factors of awakening.

source: རིགས་ཀྱི་བུ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགེ་བའི་རྩ་བ་ཡང་དག་པར་བསྒྲུབ་པ་ན་གང་དག་ནམ་དུ་ཡང་ངོམས་པར་མི་འགྱུར་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་ངོམས་པ་བཅུ་གཉིས་ཏེ།
en: Noble son, when bodhisattvas are creating roots of virtue, those are the twelve activities they never tire of.

source: དེས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགེ་བའི་ཚོགས་བསགས་པ་ལ་མི་ངོམས་པ་ཞེས་བྱའོ། །
en: It is therefore said that bodhisattvas never grow tired of gathering the accumulation of virtue.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The kiṃnara king Druma then said to the Blessed One,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་དཀོན་མཆོག་འབྱུང་གནས་ཞེས་བགྱི་བ་མཆིས་ཏེ།
en: “Blessed One, there is a bodhisattva absorption known as the source of wealth .

source: བྱང་ཆུབ་སེམས་དཔའ་ཏིང་ངེ་འཛིན་དེ་ལ་བརྟེན་ན་ཡོན་ཏན་རིན་པོ་ཆེའི་ཁྱད་པར་གྱི་ཆོས་ཐམས་ཅད་འཐོབ་པར་འགྱུར་རོ་ཞེས་བགྱི་བ་ཞིག་བདག་གིས་ཐོས་ན།
en: I have heard that if bodhisattvas rely on this absorption they will attain all extraordinary, precious qualities.

source: བཅོམ་ལྡན་འདས་གང་ཐོས་པས། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོན་ཏན་རིན་པོ་ཆེའི་ཁྱད་པར་གྱི་ཆོས་ཐམས་ཅད་འཐོབ་པར་འགྱུར་བར་བགྱི་བའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དཀོན་མཆོག་འབྱུང་གནས་དེ་བཞིན་གཤེགས་པས་ལེགས་པར་བཤད་དུ་གསོལ།
en: Blessed One, so that those bodhisattvas may hear about that absorption and attain all those extraordinary, precious qualities, could the Thus-Gone One please explain to us this bodhisattva absorption of the source of wealth ?”

source: མིའམ་ཅིའི་བདག་པོ་དེའི་ཕྱིར་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: “Lord of the kiṃnaras,” “listen carefully and keep this in mind.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དཀོན་མཆོག་འབྱུང་གནས་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: I will explain to you the bodhisattva absorption of the source of wealth .”

source: མིའམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The kiṃnara king Druma agreed to this and listened as the Blessed One had directed. The Blessed One then said,

source: མིའམ་ཅིའི་བདག་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སངས་རྒྱས་དཀོན་མཆོག་རྒྱུན་མི་འཆད་པ་དང་། ཆོས་དཀོན་མཆོག་རྒྱུན་མི་འཆད་པ་དང་། དགེ་འདུན་དཀོན་མཆོག་རྒྱུན་མི་འཆད་པར་བྱ་བའི་ཕྱིར་སེམས་བསྐྱེད་པ་རིན་པོ་ཆེ་བརྒྱད་ཅུ་པོ་འདི་དག་ལ་འཇུག་གོ། །
en: “Lord of the kiṃnaras, bodhisattvas engage in eighty precious attitudes to avoid interrupting the continuity of the Buddha Jewel, to avoid interrupting the continuity of the Dharma Jewel, and to avoid interrupting the continuity of the Saṅgha Jewel.

source: བརྒྱད་ཅུ་གང་ཞེ་ན།
en: What are those eighty?

source: དེ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་རིན་པོ་ཆེ་མི་བརྗེད་པ་དང་། ལྷག་པའི་བསམ་པའི་སེམས་རིན་པོ་ཆེ་མི་གཏོང་བ་དང་།
en: They are (1) never forgetting the precious mind of omniscience, (2) never abandoning the precious attitude of good motivation,

source: དགེ་བ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་སེམས་མི་འདོར་བ་དང་། དགེ་བ་རིན་པོ་ཆེ་ཐམས་ཅད་ལ་རབ་ཏུ་སྦྱོར་བའི་སེམས་མི་འདོར་བ་དང་།
en: (3) never giving up the attitude of being inclined toward all precious virtues, (4) never giving up the attitude of wanting to engage in all precious virtues,

source: ཡི་དམ་ལ་བརྟན་པའི་སེམས་རིན་པོ་ཆེ་ཡོངས་སུ་མི་འདོར་བ་དང་།
en: (5) never giving up the precious attitude of keeping one’s commitments,

source: བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སེམས་རིན་པོ་ཆེ་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བས་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བའི་སེམས་རིན་པོ་ཆེ་ལ་འཇུག་པ་དང་།
en: (6) the precious attitude of giving away all of one’s possessions and dedicating this toward awakening without hoping for karmic reward,

source: མི་དགེ་བའི་རྩ་བ་རྣམ་པ་གསུམ་རྣམ་པར་སྤངས་པས། ལུས་ཀྱི་རྒྱན་གྱི་སེམས་རིན་པོ་ཆེ་དང་། ངག་གི་སྐྱོན་རྣམ་པ་བཞི་རྣམ་པར་སྤངས་པས་ངག་གི་རྒྱན་གྱི་སེམས་རིན་པོ་ཆེ་དང་།
en: (7) the precious attitude that ornaments the body by abandoning the three roots of nonvirtue, (8) the precious attitude that ornaments speech by abandoning the four faults of speech,

source: བརྣབ་སེམས་དང་གནོད་སེམས་དང་ལོག་པར་ལྟ་བ་དང་བྲལ་བས་སེམས་ཀྱི་རྒྱན་གྱི་སེམས་རིན་པོ་ཆེ་དང་།
en: (9) the precious attitude that ornaments the mind by getting rid of covetousness, ill will, and wrong views,

source: ཚུལ་ཁྲིམས་མ་ཉམས་ཤིང་སྐྱོན་མེད་དེ་འདྲེན་མ་མ་ཡིན་ཞིང་ཐུན་ཚགས་མ་ཡིན་པས་ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་གྱི་སེམས་རིན་པོ་ཆེ་དང་།
en: (10) the precious attitude that ornaments discipline by maintaining uncorrupted, faultless, unadulterated, and pure discipline,

source: སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པས་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (11) the precious attitude of nonaggression based on being impartial toward all beings,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཉེས་པར་བྱས་པ་ལ་ཅི་མི་སྙམ་པས་བཟོད་པ་དང་ངེས་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (12) the precious attitude of patience and gentleness consisting of not taking offense when harmed by others,

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་ལ་ལྟ་བས་ལུས་དང་སྲོག་ལ་མི་ལྟ་བའི་སེམས་རིན་པོ་ཆེ་དང་། མཐོ་དམན་མེད་པས་རྗེས་སུ་ཆགས་པ་དང་ཁོང་ཁྲོ་བ་དང་བྲལ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (13) the precious attitude of pursuing the branches of awakening without concern for life and limb, (14) the precious attitude of being free from attachment and aversion by being without thoughts of high and low,

source: ཞུམ་པ་མེད་པས་བརྩོན་འགྲུས་བརྟན་པའི་གོ་ཆའི་སེམས་རིན་པོ་ཆེ་དང་། ལྷོད་པ་མེད་པའི་བརྩོན་པ་ཐམས་ཅད་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (15) the precious attitude of dauntlessly donning the armor of stable diligence, (16) the precious attitude of relentlessly engaging in all endeavors,

source: བྱང་ཆུབ་ཀྱི་ལམ་གྱི་ཚོགས་བསགས་པས་དྲན་པ་དང་། བློ་གྲོས་དང་། རྟོགས་པ་དང་། ངོ་ཚ་ཤེས་པ་དང་མོས་པ་བརྗེད་པ་མེད་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (17) the precious attitude of gathering the accumulations on the path of awakening and never forsaking mindfulness, intelligence, realization, humility, and devotion,

source: སེམས་ལ་དབང་བྱེད་པས་བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་བསྐྱེད་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (18) the precious attitude of giving rise to concentrations, liberations, absorptions, and attainments by gaining control over one’s mind,

source: དམ་པའི་ཆོས་བསགས་པས་ཆོས་ཡོངས་སུ་ཚོལ་བའི་སེམས་རིན་པོ་ཆེ་དང་། འཇིགས་པ་མེད་ཅིང་སྤོབས་པས་ཐོས་པ་འཛིན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (19) the precious attitude of pursuing the Dharma by gathering the sacred Dharma, (20) the precious attitude of upholding learning through fearlessness and eloquence,

source: སྡིག་པ་འདོད་པ་མེད་པས་ཟང་ཟིང་མེད་པར་ཆོས་སྟོན་པའི་སེམས་རིན་པོ་ཆེ་དང་། ཆགས་པའི་སེམས་མེད་པས་སློབ་དཔོན་ཆོས་མི་འཆབ་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (21) the precious attitude of teaching the Dharma without concern for material gains on account of not desiring any negative actions, (22) the precious attitude of teaching the Dharma without holding back due to having a mind free from attachment,

source: ནན་ཏན་སྙིང་པོར་བྱེད་པས་ཚུལ་བཞིན་དུ་ཡང་ཡིད་ལ་བྱེད་པའི་སེམས་རིན་པོ་ཆེ་དང་། དེ་ལྟར་བྱེད་པས་ཇི་ལྟར་ཐོས་པའི་ཆོས་རྣམས་ལ་ནན་ཏན་བྱེད་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (23) the precious attitude of focusing the mind correctly due to having a strong determination, (24) the precious attitude of exerting oneself in the Dharma in the way one has heard it,

source: གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པས་ཤེས་རབ་ཀྱིས་སོ་སོར་རྟོག་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (25) the precious attitude of discriminating with insight due to not being led astray by others,

source: སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པས་ཁྱབ་པས་བྱམས་པ་ཆེན་པོའི་སེམས་རིན་པོ་ཆེ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བས་སྙིང་རྗེ་ཆེན་པོའི་སེམས་རིན་པོ་ཆེ་དང་། ཆོས་ལ་དགའ་མོས་དད་པས་དགའ་བ་ཆེན་པོའི་སེམས་རིན་པོ་ཆེ་དང་། ཆོས་ཐམས་ཅད་ངེས་པར་སེམས་པས་བཏང་སྙོམས་ཆེན་པོའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (26) the precious attitude of great love due to one’s love embracing all beings, (27) the precious attitude of great compassion due to caring for all beings, (28) the precious attitude of great joy due to feeling joy, devotion, and faith toward the Dharma, (29) the precious attitude of great equanimity because one ascertains all phenomena,

source: དགེ་བའི་རྩ་བ་བསགས་པས་འཁོར་བ་ན་ཡོངས་སུ་མི་སྐྱོ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (30) the precious attitude of not getting weary in saṃsāra because one accumulates roots of virtue,

source: བདག་གི་བདེ་བ་ལ་མི་ཆགས་པས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (31) the precious attitude of ripening all beings while not being attached to one’s own happiness,

source: ཆོས་འཛིན་པས་བསྡུ་བའི་དངོས་པོའི་སེམས་རིན་པོ་ཆེ་དང་། ཐམས་ཅད་དུ་རྣམ་པར་འཕྲུལ་པས་མངོན་པར་ཤེས་པ་ཆེན་པོའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (32) the precious attitude of attracting disciples by upholding the Dharma, (33) the precious attitude of having higher perceptions because of manifesting in many ways,

source: མ་ཐོས་པའི་ཆོས་མཉན་པའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (34) the precious attitude of serving and attending to a virtuous friend in order to listen to Dharma teachings one has not heard before,

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་སོགས་པས་སྡིག་པའི་གྲོགས་པོ་སྤོང་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (35) the precious attitude of abandoning unwholesome friends because of accumulating all roots of virtue,

source: ཐ་དད་པ་མེད་པས་སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱོར་བ་མཉམ་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (36) the precious attitude of behaving in an equal manner toward all beings because of understanding that they are not different from oneself,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ལ་འཇུག་པས། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་ཡོངས་སུ་ཤེས་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (37) the precious attitude of understanding the diseases of all beings’ afflictions due to knowing the thoughts of all beings,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་ནད་རབ་ཏུ་ཞི་བར་བྱེད་པས་ཆོས་ཀྱི་སྨན་ཐམས་ཅད་ཡོངས་སུ་ཚོལ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (38) the precious attitude of pursuing all the medicines of the Dharma in order to pacify the diseases of all beings’ afflictions,

source: !ཆོས་ཀྱི་བདག་ཉིད་པས་མ་བསླབས་པ་རྣམས་ལ་མི་བརྙས་པའི་སེམས་རིན་པོ་ཆེ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་འདུད་པས་ང་རྒྱལ་མེད་པའི་སེམས་རིན་པོ་ཆེ་དང་། འཆོས་པ་མེད་པའི་གཡོ་དང་སྒྱུ་མེད་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (39) the precious attitude of not expressing contempt for those who have not trained to actualize the greatness of wisdom, (40) the precious attitude of being devoid of pride because one is respectful toward all beings, (41) the precious attitude of being honest and truthful that stems from being unpretentious,

source: !དམ་པའི་ཆོས་ཡུན་རིང་དུ་གནས་པས་ཆོས་ལ་དགའ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (42) the precious attitude of taking pleasure in the Dharma by working to ensure that the sacred Dharma remains for a long time,

source: སངས་རྒྱས་ཐམས་ཅད་ལ་བྱས་པ་གཟོ་བས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (43) the precious attitude of upholding the sacred Dharma because of feeling gratitude toward all the buddhas,

source: བརྟན་པའི་གྲོགས་པོའི་ཕྱིར་བྱས་པ་ཤེས་ཤིང་བྱས་པ་གཟོ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (44) the precious attitude of being grateful and repaying the kindness of others because of being a reliable friend,

source: ལྟོས་པ་མེད་པས་ལན་དུ་ཕན་འདོགས་པ་ལ་མི་རེ་བའི་སེམས་རིན་པོ་ཆེ་དང་། དཀར་པོའི་ཕྱོགས་སྲུང་བས་དགོན་པ་ལ་དགའ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (45) the precious attitude of not hoping for help in return for help given due to being independent, (46) the precious attitude of enjoying the wilderness on account of guarding one’s wholesome qualities,

source: ལས་བྱས་པ་ཆུད་མི་གསོན་པས་རྟག་ཏུ་རབ་ཏུ་འབྱུང་བའི་སེམས་རིན་པོ་ཆེ་དང་། སྡོམ་པའི་སྤྱོད་པ་སོགས་པས་འཕགས་པའི་རིགས་ལ་དགའ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (47) the precious attitude of constantly going forth because performed actions are not wasted, (48) the precious attitude of delighting in the mainstays of the noble ones because of maintaining one’s vows,

source: སེམས་ཅན་ཐམས་ཅད་མགུ་བར་བྱེད་པས་སྦྱངས་པའི་ཡོན་ཏན་ཐམས་ཅད་དང་ཡོ་བྱད་བསྙུངས་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (49) the precious attitude of engaging in all the ascetic practices and keeping few possessions on account of pleasing all beings,

source: ཤེས་རབ་ཀྱིས་མི་ངོམས་པས་འདོད་པ་ཆུང་ཞིང་ཆོག་ཤེས་པའི་སེམས་རིན་པོ་ཆེ་དང་། ལུས་དང་སེམས་དབེན་པས་དགའ་བ་ལ་དབེན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (50) the precious attitude of having few desires and being content due to being insatiable with regard to insight, (51) the precious attitude of remaining detached from pleasure because one is physically and mentally disengaged,

source: མཚན་དང་དཔེ་བྱད་བཟང་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་མི་ངོམས་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (52) the precious attitude of being insatiable with regard to accumulating merit, based on the wish to perfect the excellent major and minor marks,

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅད་པའི་ཕྱིར་ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་ཚོལ་བའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (53) the precious attitude of pursuing the accumulation of wisdom in order to eliminate the doubts of all beings,

source: སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བའི་ཕྱིར་སངས་རྒྱས་རྗེས་སུ་དྲན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (54) the precious attitude of recollecting the buddhas in order to never be separated from their presence,

source: ཆོས་མཉན་པ་དང་མི་འབྲལ་བའི་ཕྱིར་ཆོས་རྗེས་སུ་དྲན་པའི་སེམས་རིན་པོ་ཆེ་དང་། ཕྱིར་མི་ལྡོག་པའི་དགེ་འདུན་ལ་གཞོལ་བའི་ཕྱིར་དགེ་འདུན་རྗེས་སུ་དྲན་པའི་སེམས་རིན་པོ་ཆེ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ལས་མི་གཡོ་བའི་ཕྱིར་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པའི་སེམས་རིན་པོ་ཆེ་དང་། ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་བོར་བས་གཏོང་བ་རྗེས་སུ་དྲན་པའི་སེམས་རིན་པོ་ཆེ་དང་། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་དྲན་པའི་ཕྱིར་ལྷ་རྗེས་སུ་དྲན་པའི་སེམས་རིན་པོ་ཆེ་དང་། མཚུངས་པར་བྱེད་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་དྲན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (55) the precious attitude of recollecting the Dharma in order to never be separated from hearing its teachings, (56) the precious attitude of recollecting the Saṅgha in order to join the irreversible Saṅgha, (57) the precious attitude of recollecting discipline in order to not waver from the mind set on awakening, (58) the precious attitude of recollecting generosity by abandoning all afflictions, (59) the precious attitude of recollecting the gods in order to remember the bodhisattvas with only one birth remaining, (60) the precious attitude of recollecting the bodhisattvas in order to emulate them,

source: དོན་ཐམས་ཅད་རྟོགས་པས་དོན་སོ་སོ་ཡང་དག་པར་རིག་པའི་སེམས་རིན་པོ་ཆེ་དང་། ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པས་ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པའི་སེམས་རིན་པོ་ཆེ་དང་། སེམས་ཅན་གྱི་ཚིག་ཐམས་ཅད་རྟོགས་པས་ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པའི་སེམས་རིན་པོ་ཆེ་དང་། ཚིག་འབྲུའི་རང་བཞིན་རྗེས་སུ་རྟོགས་པས་སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (61) the precious attitude of the correct knowledge of the meaning based on understanding all meanings, (62) the precious attitude of the correct knowledge of phenomena based on the unadulterated realm of phenomena, (63) the precious attitude of the correct knowledge of language based on understanding all expressions of beings, (64) the precious attitude of the correct knowledge of eloquence based on understanding the nature of words and syllables,

source: རྣམ་པར་ཤེས་པ་སྒྱུ་མ་ལྟ་བུར་ཡོངས་སུ་ཤེས་པའི་ཚུལ་གྱིས་ཡེ་ཤེས་ལ་རྟོན་པའི་སེམས་རིན་པོ་ཆེ་དང་། བཀྲི་བའི་དོན་གྱི་མདོ་སྡེ་ལས་དང་བྱ་བ་དང་འགལ་བས་ངེས་པའི་དོན་གྱི་མདོ་སྡེ་ལ་རྟོན་པའི་སེམས་རིན་པོ་ཆེ་དང་། གང་ཟག་གི་རང་བཞིན་རྗེས་སུ་རྟོག་པས་ཆོས་ཉིད་ལ་རྟོན་པའི་སེམས་རིན་པོ་ཆེ་དང་།
en: (65) the precious attitude of relying on wisdom, based on understanding that consciousness is illusory, (66) the precious attitude of relying on the discourses of definitive meaning, since the functions and effects of the discourses of provisional meaning may be in contradiction, (67) the precious attitude of relying on the nature of reality by contemplating the nature of the person,
